Results/Verifications/S2427/bottleneck-determination/point_select/threads-16/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=16 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 11031.87 qps: 11031.87 (r/w/o: 11031.87/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 10839.66 qps: 10839.66 (r/w/o: 10839.66/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 11234.73 qps: 11234.73 (r/w/o: 11234.73/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 11193.81 qps: 11193.81 (r/w/o: 11193.81/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 11242.40 qps: 11242.40 (r/w/o: 11242.40/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 10959.71 qps: 10959.71 (r/w/o: 10959.71/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 11205.92 qps: 11205.92 (r/w/o: 11205.92/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 10628.17 qps: 10628.17 (r/w/o: 10628.17/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 11249.74 qps: 11249.74 (r/w/o: 11249.74/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 10202.54 qps: 10202.54 (r/w/o: 10202.54/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1097954
        write:                           0
        other:                           0
        total:                           1097954
    transactions:                        1097954 (10978.85 per sec.)
    queries:                             1097954 (10978.85 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0053s
    total number of events:              1097954

Latency (ms):
         min:                                    0.66
         avg:                                    1.46
         max:                                  267.12
         95th percentile:                        2.81
         sum:                              1598284.98

Threads fairness:
    events (avg/stddev):           68622.1250/225.57
    execution time (avg/stddev):   99.8928/0.00


real    1m40.085s
user    0m21.757s
sys     0m39.664s